## 6.1 文本格式数据的读写

In [2]:
import pandas as pd
import numpy as np
import sys
import csv
import json

In [6]:
! type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
! type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [8]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
! type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [14]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [2]:
! type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
! type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [5]:
result = pd.read_csv('examples/ex5.csv')

In [6]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [7]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [2]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [2]:
sentinels = {'message': ['foo', 'NA'],
             'something': ['two']}
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 6.1.1 分块读入文本文件

In [3]:
pd.options.display.max_rows = 10

In [4]:
result = pd.read_csv('examples/ex6.csv')

In [5]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [6]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [3]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
chunker

In [4]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8084\625214612.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [5]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 6.1.2 将数据写入文本格式

In [6]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [7]:
data.to_csv('examples/out.csv')

In [8]:
! type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [2]:
import sys

In [10]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [11]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [13]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [15]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [16]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)

In [17]:
ts.to_csv('examples/tseries.csv')

In [18]:
! type examples\tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### 6.1.3 使用分隔格式

In [4]:
! type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [5]:
import csv

In [14]:
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [7]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [8]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [11]:
header, values = lines[0], lines[1:]

In [12]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [15]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

In [16]:
reader = csv.reader(f, delimiter='|')

In [18]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### 6.1.4 JSON数据

In [2]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [3]:
import json

In [4]:
result = json.loads(obj)

In [5]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [6]:
asjson = json.dumps(result)

In [7]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [9]:
! type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [8]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [12]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### 6.1.5 XML和HTML：网络抓取

In [13]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [14]:
len(tables)

1

In [15]:
failures = tables[0]

In [16]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [17]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [18]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

#### 6.1.5.1 使用lxml.objectify解析XML

In [19]:
from lxml import objectify

In [20]:
path = 'datasets/mta_perf/Performance_MNR.xml'

In [21]:
parsed = objectify.parse(open(path))

In [22]:
root = parsed.getroot()

In [24]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [25]:
perf = pd.DataFrame(data)
perf.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.0,96.9,95.0,96.9
1,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.0,96.0,95.0,95.0
2,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.0,96.3,95.0,96.9
3,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.0,96.8,95.0,98.3
4,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.0,96.6,95.0,95.8

In [26]:
from io import StringIO

In [27]:
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [28]:
root

In [29]:
root.get('href')

'http://www.google.com'

In [30]:
root.text

'Google'

## 6.2 二进制格式

In [3]:
frame = pd.read_csv('examples/ex1.csv')

In [4]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
frame.to_pickle('examples/frame_pickle')

In [6]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 6.2.1 使用HDF5格式

In [7]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [9]:
store = pd.HDFStore('mydata.h5')

In [10]:
store['obj1'] = frame

In [11]:
store['obj1_col'] = frame['a']

In [12]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [13]:
store['obj1']

           a
0  -2.067616
1  -0.433943
2   0.489403
3   0.860712
4  -1.355752
..       ...
95 -0.874357
96  1.134827
97  0.179159
98 -0.105195
99  0.744339

[100 rows x 1 columns]

In [14]:
store.put('obj2', frame, format='table')

In [15]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.764054
11 -0.913616
12 -0.523039
13 -0.175736
14  0.878201
15 -0.263269

In [16]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [19]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -2.067616
1 -0.433943
2  0.489403
3  0.860712
4 -1.355752

In [18]:
store.close()

### 6.2.2 读取Microsoft Excel文件

In [20]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [21]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [22]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [23]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [24]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [25]:
frame.to_excel(writer, 'Sheet1')

In [27]:
frame.to_excel('examples/ex2.xlsx')

## 6.3 与Web API交互

In [28]:
import requests

In [29]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [30]:
resp = requests.get(url)

In [31]:
resp

In [32]:
data = resp.json()

In [33]:
data[0]['title']

"BUG: is a child element contains NULL this results in a TypeError: 'NoneType' object is not iterable"

In [34]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,53719,BUG: is a child element contains NULL this res...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,53718,DOC: Update the DataFrame.copy docstring to no...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,53717,BUG: Aggregation on arrow array return same type.,[],open
3,53714,Create 0007-compact-and-reversible-JSON-interf...,"[{'id': 4253279386, 'node_id': 'LA_kwDOAA0YD87...",open
4,53713,QST: How to prepare my data to avoid being una...,"[{'id': 34444536, 'node_id': 'MDU6TGFiZWwzNDQ0...",open
5,53712,ENH: Replace s3fs dependency with awswrangler,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
6,53711,REF/PERF: replace with ArrowEA,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
7,53710,DEPR: Deprecate DataFrame.last and Series.last,[],open
8,53709,BUG: period_range gives incorrect output,[],open
9,53708,DEPR: pd.merge vs DataFrame.merge,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
10,53707,BUG: make SeriesGroupBy nlargest and nsmallest...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,53706,BUG: SeriesGroupBy nlargest with as_index=Fals...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,53704,CoW: Return read-only array in Index.values,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
13,53703,BUG: IntervalIndex.get_indexer raising for rea...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
14,53702,BUG: concat coercing arrow to object with null...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
15,53701,BUG: read_parquet from public parquet file wit...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,53700,BUG: `Series.combine_first()` changes int dtyp...,"[{'id': 2365504893, 'node_id': 'MDU6TGFiZWwyMz...",open
17,53699,API / COW: ensure every new Series/DataFrame a...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
18,53698,Fixed #52234,[],open
19,53697,PERF: concatenation of MultiIndexed objects (M...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
20,53696,ENH: allow EAs to override MergeOperation._get...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
21,53695,API/DEPR: pd.array don't cast numpy int/float/...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,53694,API: rename PandasArray -> NumpyExtensionArray,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
23,53692,DEPR: deprecate DataFrame.last and Series.last,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
24,53689,DOC: Fixing EX01 - Added examples,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
25,53687,BUG: `period_range` gives incorrect output,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,53686,BUG: to_json returns incorrect timestamps if D...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,53685,BUILD: Issue while creating DEV environment us...,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
28,53684,BUG: Plotting with DatetimeIndex with specific...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,53683,TST: Add test for duplcated columns and usecol...,[],open

## 6.4 与数据库交互

In [35]:
import sqlite3

In [36]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [37]:
con = sqlite3.connect('mydata.sqlite')

In [38]:
con.execute(query)

In [39]:
con.commit()

In [40]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [41]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [43]:
con.commit()

In [44]:
cursor = con.execute('select * from test')

In [45]:
rows =  cursor.fetchall()

In [46]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [47]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [48]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [50]:
import sqlalchemy as sqla

In [51]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [52]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5